# PanelScheduleSwitchboardSlotInconsistency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..PanelScheduleSwitchboardSlotInconsistency Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
The template applied to this panel schedule is set to display fewer space than what is needed to display the max number of circuits set on the equipment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PanelScheduleSwitchboardSlotInconsistency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelScheduleSwitchboardSlotInconsistency As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PanelScheduleSwitchboardSlotInconsistency {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace